{
  "2.3.1": {
    "en": "Added capability mapping for measure_water, valve_state and target_distance. Stability improvements."
  },
  "2.3.0": {
    "en": "Fixed capabilities naming and units migration. Added open_window mapping."
  },
  "2.2.2": {
    "en": "Replaced mapping for temperature and temperature.local capabilities."
  },
  "2.2.1": {
    "en": "Added support for center button on three-way switch (Kringloper)."
  },
  "2.2.0": {
    "en": "Added force bridge log level to INFO on startup. Added Bridge flow cards for restart, allow_joining and set_log_level. Improved Msgs/minute counter."
  },
  "2.1.5": {
    "en": "Added support for Ikea blinds (Fyrtur, Kadrilj, Praktlysing, Tredansen)."
  },
  "2.1.4": {
    "en": "Added support for left/right switch (Livolo TI0001)."
  },
  "2.1.3": {
    "en": "Fixed vibration alarm flow card. Improved app startup behavior."
  },
  "2.1.2": {
    "en": "Fixed color mode for lights."
  },
  "2.1.1": {
    "en": "Fixed groups without members. Added support for HUE smart button and Aqara temperature, humidity and pressure sensor."
  },
  "2.1.0": {
    "en": "Added Zigbee Group support (BETA). Fixed color mode for the lights. Added more class mappings. Added support for HUE wall switch."
  },
  "2.0.5": {
    "en": "Fixed ever migrating devices with duplicate capabilities. Added support to GreenPower devices."
  },
  "2.0.4": {
    "en": "Fixed fault and vibration trigger cards."
  },
  "2.0.3": {
    "en": "Actions are now always triggered, even when action didn't change. Stability improvements"
  },
  "2.0.2": {
    "en": "Typo fixes. Added trigger flowcard. Stability improvements"
  },
  "2.0.1": {
    "en": "Added several trigger flowcards. Stability improvements."
  },
  "2.0.0": {
    "en": "Greatly extended capability support, including buttons, actions, color lights. Added many flowcards."
  },
  "1.3.0": {
    "en": "Inhibit state retrieval for battery devices, or sending command to read-only exposes. Added power_on_behavior, power_outage_memory, indicator_mode. Added thermostat preset and system_mode."
  },
  "1.2.1": {
    "en": "Improved thermostat capability mapping. Improved capability unit migration."
  },
  "1.2.0": {
    "en": "Device: Auto restart after bridge reconnect. Added more device capabilities and subcapabilities. Added more settable capabilities (target_temperature, locked). Added migration check on start. Added thermostat valve class."
  },
  "1.1.0": {
    "en": "Device: Bridge offline detection. Bridge: Added disconnect alarm, join switch, # joined devices, messages per minute."
  },
  "1.0.6": {
    "en": "Stability fixes. Increased maxListeners (devices) to 100."
  },
  "1.0.5": {
    "en": "Added device class mapping. Added additional device information in settings."
  },
  "1.0.4": {
    "en": "Fix app crash on setCommand."
  },
  "1.0.3": {
    "en": "Added many device capabilities. Bridge available/unavailable detection added."
  },
  "1.0.2": {
    "en": "Fix adding bridge."
  },
  "1.0.1": {
    "en": "Code updates and stability fixes."
  },
  "1.0.0": {
    "en": "First release"
  }
}
